#### 연습 문제 4.1.1

In [3]:
import numpy as np
import pandas as pd

In [15]:
a = pd.Series([10, 20, 30, 40],
              index=["가", "나", "다", "라"])
a

가    10
나    20
다    30
라    40
dtype: int64

In [16]:
b = pd.Series([1, 2, 3, 4],
              index=["가", "나", "다", "마"])
b

가    1
나    2
다    3
마    4
dtype: int64

In [17]:
a + b

가    11.0
나    22.0
다    33.0
라     NaN
마     NaN
dtype: float64

In [18]:
a - b

가     9.0
나    18.0
다    27.0
라     NaN
마     NaN
dtype: float64

In [19]:
a * b

가    10.0
나    40.0
다    90.0
라     NaN
마     NaN
dtype: float64

In [20]:
a / b

가    10.0
나    10.0
다    10.0
라     NaN
마     NaN
dtype: float64

#### 연습 문제 4.1.2

In [23]:
data = {
    "2021": [1, '가', 2.5, 75, '서울'],
    "2020": [2, '나', 3.14, 34, '대전'],
    "2019": [3, '다', 5.66, 36, '울산'],
    "2018": [4, '라', 1.3, 24, '경기'],
    "2017": [5, '마', 4.9, 21, '부산']
}
df = pd.DataFrame(data)
df

  2021  2020  2019 2018 2017
0    1     2     3    4    5
1    가     나     다    라    마
2  2.5  3.14  5.66  1.3  4.9
3   75    34    36   24   21
4   서울    대전    울산   경기   부산

#### 연습 문제 4.1.3

In [61]:
score = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df2 = pd.DataFrame(score, index=index, columns=columns)
df2

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [62]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df2['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [63]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df2[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [64]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df2['평균'] = df2.mean(axis=1).round(2)
df2

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [65]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df2['영어'] = [90, 70, 60, 80]
df2

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  46.67

In [66]:
df2['평균'] = df2.mean(axis=1).round(2)
df2

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  56.67

In [70]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df2[:1]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [81]:
# (5) 향단의 점수를 시리즈로 나타낸다.
df2.loc['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

#### 연습 문제 4.3.1

In [97]:
# 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
data = {
    "가": [1, 6, 2.5, 75, 21],
    "나": [2, 7, 3.14, 34, 20],
    "다": [3, 8, 5.66, 36, 19],
    "라": [4, 9, 1.3, 24, 18],
    "마": [5, 10, 4.9, 21, 17]
}
columns = ["가", "나", "다", "라", "마"]
index = ["서울", "부산", "대전", "인천", "울산"]
df3 = pd.DataFrame(data, index=index, columns=columns)
df3

       가      나      다     라     마
서울   1.0   2.00   3.00   4.0   5.0
부산   6.0   7.00   8.00   9.0  10.0
대전   2.5   3.14   5.66   1.3   4.9
인천  75.0  34.00  36.00  24.0  21.0
울산  21.0  20.00  19.00  18.0  17.0

In [ ]:
# 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [98]:
df3['가']

서울     1.0
부산     6.0
대전     2.5
인천    75.0
울산    21.0
Name: 가, dtype: float64

In [100]:
df3.다

서울     3.00
부산     8.00
대전     5.66
인천    36.00
울산    19.00
Name: 다, dtype: float64

In [102]:
df3[['나']]

        나
서울   2.00
부산   7.00
대전   3.14
인천  34.00
울산  20.00

In [110]:
df3[4:]

       가     나     다     라     마
울산  21.0  20.0  19.0  18.0  17.0

In [112]:
df3['대전':'인천']

       가      나      다     라     마
대전   2.5   3.14   5.66   1.3   4.9
인천  75.0  34.00  36.00  24.0  21.0

In [114]:
df3.loc['서울']

가    1.0
나    2.0
다    3.0
라    4.0
마    5.0
Name: 서울, dtype: float64

In [118]:
df3.loc[df3.라 > 10]

       가     나     다     라     마
인천  75.0  34.0  36.0  24.0  21.0
울산  21.0  20.0  19.0  18.0  17.0

In [126]:
df3.loc['인천':, '라':]

       라     마
인천  24.0  21.0
울산  18.0  17.0

In [135]:
df3.iloc[0]

가    1.0
나    2.0
다    3.0
라    4.0
마    5.0
Name: 서울, dtype: float64

In [134]:
df3.iloc[3:, 4:]

       마
인천  21.0
울산  17.0

#### 연습 문제 4.4.1

In [136]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [142]:
# 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

#### 연습 문제 4.4.2

In [156]:
# 타이타닉호 승객에 대해 성별(sex) 인원수
titanic.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [157]:
# 나이별(age) 인원수
titanic.age.value_counts()

24.00    30
22.00    27
18.00    26
28.00    25
19.00    25
         ..
55.50     1
74.00     1
0.92      1
70.50     1
12.00     1
Name: age, Length: 88, dtype: int64

In [158]:
# 선실별(pclass) 인원수
titanic.pclass.value_counts()

3    491
1    216
2    184
Name: pclass, dtype: int64

In [160]:
# 사망/생존(alive) 인원수
titanic.alive.value_counts()

no     549
yes    342
Name: alive, dtype: int64

#### 연습 문제 4.4.3

In [193]:
# 타이타닉호 승객의 평균 나이
titanic['age'].mean().round(0)

30.0

In [180]:
# 타이타닉호 승객중 여성 승객의 평균 나이
titanic_female = titanic.loc[titanic.sex == 'female']
titanic_female

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [194]:
titanic_female['age'].mean().round(0)

28.0

In [183]:
# 타이타닉호 승객중 1등실 여성 승객의 평균 나이
titanic_female_first = titanic_female.loc[titanic.pclass == 1]
titanic_female_first

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
31,1,1,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
52,1,1,female,49.0,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
856,1,1,female,45.0,1,1,164.8667,S,First,woman,False,NaN,Southampton,yes,False
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True

In [195]:
titanic_female_first['age'].mean().round(0)

35.0

#### 연습 문제 4.4.4

In [ ]:
타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.

20살이 넘으면 성별을 그대로 사용한다.
20살 미만이면 성별에 관계없이 “child”라고 한다.

In [186]:
titanic["category1"] = titanic.apply(
    lambda x: "adult" if r.age >= 20 else "child", axis=1
    )
titanic.tail()

SyntaxError: invalid syntax (<ipython-input-186-6e6c53d3e5f4>, line 3)

#### 연습 문제 4.4.5

In [ ]:
# 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.

In [203]:
titanic['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [238]:
titanic['age'].fillna(30)
titanic['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    30.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

#### 연습 문제 4.4.6

In [ ]:
# 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라. ex) male27